import { Ticket } from "@/features/ticketing/types";

export const mockTicket: Ticket = {
  id: "1", // شناسه تیکت
  date: {
    created_at: {
      // تاریخ و زمان ایجاد تیکت
      time: "15:45", // زمان در فرمت 24 ساعته
      jalali: "1404/02/28 15:45:06", // تاریخ شمسی
      milady: "2025/05/18 15:45:06", // تاریخ میلادی
    },
    updated_at: {
      // تاریخ و زمان آخرین به‌روزرسانی تیکت
      time: "15:55", // زمان به‌روزرسانی
      jalali: "1404/03/06 15:55:54", // تاریخ شمسی آخرین به‌روزرسانی
      milady: "2025/05/27 15:55:54", // تاریخ میلادی آخرین به‌روزرسانی
    },
  },
  priority: {
    key: "UP", // اولویت تیکت (UP برای اولویت بالا)
    value: "بالا", // توضیحات اولویت
  },
  fk_department: {
    key: 2, // شناسه دپارتمان
    value: "پشتیبانی", // نام دپارتمان مسئول
  },
  fk_order_id: null, // شناسه سفارش (اگر وجود داشته باشد)
  fk_sender_id: 13, // شناسه کاربری فرستنده
  fk_agent_id: null, // شناسه کاربری عامل پاسخ‌دهنده (اگر وجود داشته باشد)
  lock: true, // وضعیت قفل بودن تیکت (true به معنی قفل است)
  seen: 0, // وضعیت دیده شدن تیکت (0 به معنی دیده نشده)
  ticket_id: "1", // شناسه یکتای تیکت
  fk_department_id: 2, // شناسه دپارتمان مسئول (پشتیبانی)
  title: "خدمات سایت", // عنوان تیکت
  status: {
    key: "ANSWERED", // وضعیت تیکت (ANSWERED به معنی پاسخ داده شده)
    label: "پاسخ داده شده", // برچسب توضیحی وضعیت
  },
  user: {
    id: 86, // شناسه کاربر
    mobile: "09170000000", // شماره موبایل کاربر
    name: "تست", // نام کاربر
    ip: "::1", // آدرس IP کاربر
    create: "1403/07/21 16:35:56", // تاریخ و زمان ایجاد حساب کاربری
    first_name: "تست", // نام کوچک کاربر
    last_name: "تست", // نام خانوادگی کاربر
    national_code: "تست", // کد ملی کاربر
    phone: null, // شماره تلفن کاربر (در دسترس نیست)
    email: null, // ایمیل کاربر (در دسترس نیست)
    avatar: "https://storage.cafearz.com/wp-content/uploads/avatars/2.png", // لینک تصویر پروفایل کاربر
    we_trust: 0, // اعتماد به کاربر (0 به معنی عدم اعتماد)
    no_trust: 0, // عدم اعتماد به کاربر (0 به معنی ندارد)
    verifications: [
      // وضعیت تایید حساب کاربر
      {
        title: "موبایل", // عنوان تایید
        key: "MOBILE", // کلید تایید (MOBILE به معنی تایید شماره موبایل)
        is_confirmed: true, // وضعیت تایید (true به معنی تایید شده)
        status: {
          title: "تایید", // وضعیت تایید
          key: "CONFIRMED", // وضعیت تایید شده
        },
      },
      {
        title: "ایمیل", // عنوان تایید
        key: "EMAIL", // کلید تایید ایمیل
        is_confirmed: false, // وضعیت تایید (false به معنی تایید نشده)
        status: {
          title: "ثبت نشده", // وضعیت تایید نشده
          key: "EM", // کلید تایید نشده
        },
      },
    ],
    status: 1, // وضعیت کاربر (1 به معنی فعال)
    legal: false, // وضعیت حقوقی بودن کاربر (false به معنی غیرحقوقی)
    tfa_type: "MOBILE", // نوع تایید دو مرحله‌ای (MOBILE به معنی موبایل)
    shahkar: {
      color: "default", // رنگ شاهکار
      label: "استعلام نشده", // برچسب شاهکار
      key: "no_check", // کلید وضعیت شاهکار
    },
    balance: 0, // موجودی حساب کاربر
    verify: {
      mobile: true, // تایید شماره موبایل
      email: false, // تایید ایمیل
    },
    level: "E", // سطح کاربر (E به معنی سطح پایین)
  },
  user_info: {
    is_admin: false, // آیا کاربر ادمین است یا خیر
    name: "تست", // نام کاربر
    avatar: "https://storage.cafearz.com/wp-content/uploads/avatars/2.png", // تصویر پروفایل کاربر
  },
  content: "<p>به کافه ارز خوش آمدید...</p>", // محتوای تیکت
  replies: [
    // لیست پاسخ‌ها به تیکت
    {
      user_info: {
        is_admin: true, // آیا پاسخ‌دهنده ادمین است؟
        name: "تست", // نام پاسخ‌دهنده
        avatar: "https://storage.cafearz.com/wp-content/uploads/avatars/10.png", // تصویر پروفایل پاسخ‌دهنده
      },
      content: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ...", // محتوای پاسخ
      date: {
        created_at: {
          // تاریخ و زمان ایجاد پاسخ
          time: "13:50", // زمان در فرمت 24 ساعته
          jalali: "1404/03/04 13:50:36", // تاریخ شمسی
          milady: "2025/05/25 13:50:36", // تاریخ میلادی
        },
      },
    },
  ],
};
